tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

#brew

brew "ack"
brew "chezmoi"
brew "fzf"
brew "ghostscript"
brew "git"
brew "hdf5"
brew "mackup"
brew "mas"
brew "neofetch"
brew "p7zip"
brew "pyenv"
brew "python@3.9"
brew "python@3.10"
brew "transmission-cli"
brew "vim"
brew "romkatv/powerlevel10k/powerlevel10k"

# cask

cask "appcleaner"
cask "aldente"
casl "alfred"
cask "altserver"
cask "bartender"
cask "cheatsheet"
cask "discord"
cask "iterm2"
cask "mactex"
cask "miniforge"
cask "notion"
cask "numi"
cask "skim"
cask "slack"
cask "steam"
cask "tex-live-utility"
cask "texpad"
cask "tg-pro"
cask "transmission"
cask "vnc-viewer"
cask "whatsapp"

#mas

mas "1Blocker", id: 1365531024
mas "Affinity Designer", id: 824171161
mas "Amphetamine", id: 937984704
mas "DaisyDisk", id: 411643860
mas "Dropzone 4", id: 1485052491
mas "Grammarly for Safari", id: 1462114288
mas "Infuse", id: 1136220934
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Noir", id: 1592917505
mas "NordVPN", id: 905953485
mas "Notion Web Clipper", id: 1559269364
mas "OneDrive", id: 823766827
mas "Parcel", id: 639968404
mas "Peek", id: 1554235898
mas "Spark", id: 1176895641
mas "Tampermonkey", id: 1482490089
mas "Termius", id: 1176074088
